driver-tests/bpelse/assign/AssignJbi/test/results/echoRoundNegInvoke/Actual_20130314183857_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoRound" xmlns:msgns="http://stc.com/echoRound">
      <value1>-7001</value1>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>